In [3]:
import pandas as pd
import numpy as np

# Load data from a CSV file
data = pd.read_csv("D:\\MSc-IT\\Part 1\\SEM 1\\IDS\\Practicals\\Practical 3\\iris.csv")
print("Original Data:")
df = pd.DataFrame(data)
print(df)

Original Data:
     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [4]:
# Information about the DataFrame
print("Information:")
print(df.info())
print("\n")

Information:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal.length  150 non-null    float64
 1   sepal.width   150 non-null    float64
 2   petal.length  150 non-null    float64
 3   petal.width   150 non-null    float64
 4   variety       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB
None

In [5]:
# Description of the DataFrame
print("Description:")
print(df.describe())
print("\n")

Description:
       sepal.length  sepal.width  petal.length  petal.width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [6]:
# Data types of each column
print("Data types of each column:")
print(df.dtypes)
print("\n")

Data types of each column:
sepal.length    float64
sepal.width     float64
petal.length    float64
petal.width     float64
variety          object
dtype: object

In [7]:
# Total number of non-null values in each column
print("Total number of records:")
print(df.count())
print("\n")

Total number of records:
sepal.length    150
sepal.width     150
petal.length    150
petal.width     150
variety         150
dtype: int64

In [8]:
# Total number of rows and columns
print("Total number of rows and columns:")
print(df.shape)
print("\n")

Total number of rows and columns:
(150, 5)

In [9]:
# Column names
print("Column names:")
print(df.columns)
print("\n")

Column names:
Index(['sepal.length', 'sepal.width', 'petal.length', 'petal.width',
       'variety'],
      dtype='object')

In [10]:
# Column values as a NumPy array
print("Column values:")
print(df.values)
print("\n")

Column values:
[[5.1 3.5 1.4 0.2 'Setosa']
 [4.9 3.0 1.4 0.2 'Setosa']
 [4.7 3.2 1.3 0.2 'Setosa']
 [4.6 3.1 1.5 0.2 'Setosa']
 [5.0 3.6 1.4 0.2 'Setosa']
 [5.4 3.9 1.7 0.4 'Setosa']
 [4.6 3.4 1.4 0.3 'Setosa']
 [5.0 3.4 1.5 0.2 'Setosa']
 [4.4 2.9 1.4 0.2 'Setosa']
 [4.9 3.1 1.5 0.1 'Setosa']
 [5.4 3.7 1.5 0.2 'Setosa']
 [4.8 3.4 1.6 0.2 'Setosa']
 [4.8 3.0 1.4 0.1 'Setosa']
 [4.3 3.0 1.1 0.1 'Setosa']
 [5.8 4.0 1.2 0.2 'Setosa']
 [5.7 4.4 1.5 0.4 'Setosa']
 [5.4 3.9 1.3 0.4 'Setosa']
 [5.1 3.5 1.4 0.3 'Setosa']
 [5.7 3.8 1.7 0.3 'Setosa']
 [5.1 3.8 1.5 0.3 'Setosa']
 [5.4 3.4 1.7 0.2 'Setosa']
 [5.1 3.7 1.5 0.4 'Setosa']
 [4.6 3.6 1.0 0.2 'Setosa']
 [5.1 3.3 1.7 0.5 'Setosa']
 [4.8 3.4 1.9 0.2 'Setosa']
 [5.0 3.0 1.6 0.2 'Setosa']
 [5.0 3.4 1.6 0.4 'Setosa']
 [5.2 3.5 1.5 0.2 'Setosa']
 [5.2 3.4 1.4 0.2 'Setosa']
 [4.7 3.2 1.6 0.2 'Setosa']
 [4.8 3.1 1.6 0.2 'Setosa']
 [5.4 3.4 1.5 0.4 'Setosa']
 [5.2 4.1 1.5 0.1 'Setosa']
 [5.5 4.2 1.4 0.2 'Setosa']
 [4.9 3.1 1.5 0.2 'Setosa']
 [5.0 3.2 1.2 0.2 'Setosa']
 [5.5 3.5 1.3 0.2 'Setosa']
 [4.9 3.6 1.4 0.1 'Setosa']
 [4.4 3.0 1.3 0.2 'Setosa']
 [5.1 3.4 1.5 0.2 'Setosa']
 [5.0 3.5 1.3 0.3 'Setosa']
 [4.5 2.3 1.3 0.3 'Setosa']
 [4.4 3.2 1.3 0.2 'Setosa']
 [5.0 3.5 1.6 0.6 'Setosa']
 [5.1 3.8 1.9 0.4 'Setosa']
 [4.8 3.0 1.4 0.3 'Setosa']
 [5.1 3.8 1.6 0.2 'Setosa']
 [4.6 3.2 1.4 0.2 'Setosa']
 [5.3 3.7 1.5 0.2 'Setosa']
 [5.0 3.3 1.4 0.2 'Setosa']
 [7.0 3.2 4.7 1.4 'Versicolor']
 [6.4 3.2 4.5 1.5 'Versicolor']
 [6.9 3.1 4.9 1.5 'Versicolor']
 [5.5 2.3 4.0 1.3 'Versicolor']
 [6.5 2.8 4.6 1.5 'Versicolor']
 [5.7 2.8 4.5 1.3 'Versicolor']
 [6.3 3.3 4.7 1.6 'Versicolor']
 [4.9 2.4 3.3 1.0 'Versicolor']
 [6.6 2.9 4.6 1.3 'Versicolor']
 [5.2 2.7 3.9 1.4 'Versicolor']
 [5.0 2.0 3.5 1.0 'Versicolor']
 [5.9 3.0 4.2 1.5 'Versicolor']
 [6.0 2.2 4.0 1.0 'Versicolor']
 [6.1 2.9 4.7 1.4 'Versicolor']
 [5.6 2.9 3.6 1.3 'Versicolor']
 [6.7 3.1 4.4 1.4 'Versicolor']
 [5.6 3.0 4.5 1.5 'Versicolor']
 [5.8 2.7 4.1 1.0 'Versicolor']
 [6.2 2.2 4.5 1.5 'Versicolor']
 [5.6 2.5 3.9 1.1 'Versicolor']
 [5.9 3.2 4.8 1.8 'Versicolor']
 [6.1 2.8 4.0 1.3 'Versicolor']
 [6.3 2.5 4.9 1.5 'Versicolor']
 [6.1 2.8 4.7 1.2 'Versicolor']
 [6.4 2.9 4.3 1.3 'Versicolor']
 [6.6 3.0 4.4 1.4 'Versicolor']
 [6.8 2.8 4.8 1.4 'Versicolor']
 [6.7 3.0 5.0 1.7 'Versicolor']
 [6.0 2.9 4.5 1.5 'Versicolor']
 [5.7 2.6 3.5 1.0 'Versicolor']
 [5.5 2.4 3.8 1.1 'Versicolor']
 [5.5 2.4 3.7 1.0 'Versicolor']
 [5.8 2.7 3.9 1.2 'Versicolor']
 [6.0 2.7 5.1 1.6 'Versicolor']
 [5.4 3.0 4.5 1.5 'Versicolor']
 [6.0 3.4 4.5 1.6 'Versicolor']
 [6.7 3.1 4.7 1.5 'Versicolor']
 [6.3 2.3 4.4 1.3 'Versicolor']
 [5.6 3.0 4.1 1.3 'Versicolor']
 [5.5 2.5 4.0 1.3 'Versicolor']
 [5.5 2.6 4.4 1.2 'Versicolor']
 [6.1 3.0 4.6 1.4 'Versicolor']
 [5.8 2.6 4.0 1.2 'Versicolor']
 [5.0 2.3 3.3 1.0 'Versicolor']
 [5.6 2.7 4.2 1.3 'Versicolor']
 [5.7 3.0 4.2 1.2 'Versicolor']
 [5.7 2.9 4.2 1.3 'Versicolor']
 [6.2 2.9 4.3 1.3 'Versicolor']
 [5.1 2.5 3.0 1.1 'Versicolor']
 [5.7 2.8 4.1 1.3 'Versicolor']
 [6.3 3.3 6.0 2.5 'Virginica']
 [5.8 2.7 5.1 1.9 'Virginica']
 [7.1 3.0 5.9 2.1 'Virginica']
 [6.3 2.9 5.6 1.8 'Virginica']
 [6.5 3.0 5.8 2.2 'Virginica']
 [7.6 3.0 6.6 2.1 'Virginica']
 [4.9 2.5 4.5 1.7 'Virginica']
 [7.3 2.9 6.3 1.8 'Virginica']
 [6.7 2.5 5.8 1.8 'Virginica']
 [7.2 3.6 6.1 2.5 'Virginica']
 [6.5 3.2 5.1 2.0 'Virginica']
 [6.4 2.7 5.3 1.9 'Virginica']
 [6.8 3.0 5.5 2.1 'Virginica']
 [5.7 2.5 5.0 2.0 'Virginica']
 [5.8 2.8 5.1 2.4 'Virginica']
 [6.4 3.2 5.3 2.3 'Virginica']
 [6.5 3.0 5.5 1.8 'Virginica']
 [7.7 3.8 6.7 2.2 'Virginica']
 [7.7 2.6 6.9 2.3 'Virginica']
 [6.0 2.2 5.0 1.5 'Virginica']
 [6.9 3.2 5.7 2.3 'Virginica']
 [5.6 2.8 4.9 2.0 'Virginica']
 [7.7 2.8 6.7 2.0 'Virginica']
 [6.3 2.7 4.9 1.8 'Virginica']
 [6.7 3.3 5.7 2.1 'Virginica']
 [7.2 3.2 6.0 1.8 'Virginica']
 [6.2 2.8 4.8 1.8 'Virginica']
 [6.1 3.0 4.9 1.8 'Virginica']
 [6.4 2.8 5.6 2.1 'Virginica']
 [7.2 3.0 5.8 1.6 'Virginica']
 [7.4 2.8 6.1 1.9 'Virginica']
 [7.9 3.8 6.4 2.0 'Virginica']
 [6.4 2.8 5.6 2.2 'Virginica']
 [6.3 2.8 5.1 1.5 'Virginica']
 [6.1 2.6 5.6 1.4 'Virginica']
 [7.7 3.0 6.1 2.3 'Virginica']
 [6.3 3.4 5.6 2.4 'Virginica']
 [6.4 3.1 5.5 1.8 'Virginica']
 [6.0 3.0 4.8 1.8 'Virginica']
 [6.9 3.1 5.4 2.1 'Virginica']
 [6.7 3.1 5.6 2.4 'Virginica']
 [6.9 3.1 5.1 2.3 'Virginica']
 [5.8 2.7 5.1 1.9 'Virginica']
 [6.8 3.2 5.9 2.3 'Virginica']
 [6.7 3.3 5.7 2.5 'Virginica']
 [6.7 3.0 5.2 2.3 'Virginica']
 [6.3 2.5 5.0 1.9 'Virginica']
 [6.5 3.0 5.2 2.0 'Virginica']
 [6.2 3.4 5.4 2.3 'Virginica']
 [5.9 3.0 5.1 1.8 'Virginica']]

In [11]:
# Dimension of the DataFrame
print("Dimension of dataframe:")
print(df.ndim)
print("\n")

Dimension of dataframe:
2

In [12]:
# Size of the DataFrame (total number of elements)
print("Size of dataframe:")
print(df.size)
print("\n")

Size of dataframe:
750

In [13]:
# Checking for null/missing/blank values
print("Checking null/missing/blank values:")
print(df.isnull())
print("\n")

Checking null/missing/blank values:
     sepal.length  sepal.width  petal.length  petal.width  variety
0           False        False         False        False    False
1           False        False         False        False    False
2           False        False         False        False    False
3           False        False         False        False    False
4           False        False         False        False    False
..            ...          ...           ...          ...      ...
145         False        False         False        False    False
146         False        False         False        False    False
147         False        False         False        False    False
148         False        False         False        False    False
149         False        False         False        False    False

[150 rows x 5 columns]

In [14]:
# Checking for non-null values
print("Checking non-null values:")
print(df.notnull())
print("\n")

Checking non-null values:
     sepal.length  sepal.width  petal.length  petal.width  variety
0            True         True          True         True     True
1            True         True          True         True     True
2            True         True          True         True     True
3            True         True          True         True     True
4            True         True          True         True     True
..            ...          ...           ...          ...      ...
145          True         True          True         True     True
146          True         True          True         True     True
147          True         True          True         True     True
148          True         True          True         True     True
149          True         True          True         True     True

[150 rows x 5 columns]

In [15]:
# Checking for null/missing/blank values and filling with a given value
print("Checking null/missing/blank values and fill with given values:")
print(df.fillna(1))  # 1 can be replaced by any other value
print("\n")

Checking null/missing/blank values and fill with given values:
     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [16]:
# Replacing NaN values with a given value
print("Replace the NaN values with given values:")
print(df.replace(to_replace=np.nan, value=0))  # 0 can be replaced by any other value

Replace the NaN values with given values:
     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [17]:
'''
Questions
'''

'\nQuestions\n'

In [66]:
data = { 'EmpName' : ['Rohan','ShreeLaxmee','Priyanka','Vijay', 'Biswajeet'],
    'DOJ' : ['01-02-2000', '03-05-2010', '01-02-2006', '10-08-2004', 'None'],
     'Exp' : ['10 years', '5 years', 'NaN', '15 years', '30 years'],
     'Pkg' : ['NaN',3000000,4500000,650000,4000000],
     'Manager' : ['Sakpal', 'Sanap', 'Sakpal', 'Pankaj', 'Sanika'],
     'Team' : ['Marketing', 'Digital', 'Legal', 'Marketing', 'Legal'],
}
df = pd.DataFrame(data)
df

       EmpName         DOJ       Exp      Pkg Manager       Team
0        Rohan  01-02-2000  10 years      NaN  Sakpal  Marketing
1  ShreeLaxmee  03-05-2010   5 years  3000000   Sanap    Digital
2     Priyanka  01-02-2006       NaN  4500000  Sakpal      Legal
3        Vijay  10-08-2004  15 years   650000  Pankaj  Marketing
4    Biswajeet        None  30 years  4000000  Sanika      Legal

In [68]:
# Replace 'NaN' with np.nan
df.replace('NaN', np.nan, inplace=True)

# Explicitly infer data types to retain old behavior
df = df.infer_objects(copy=False)

df

       EmpName         DOJ       Exp        Pkg Manager       Team
0        Rohan  01-02-2000  10 years        NaN  Sakpal  Marketing
1  ShreeLaxmee  03-05-2010   5 years  3000000.0   Sanap    Digital
2     Priyanka  01-02-2006       NaN  4500000.0  Sakpal      Legal
3        Vijay  10-08-2004  15 years   650000.0  Pankaj  Marketing
4    Biswajeet        None  30 years  4000000.0  Sanika      Legal

In [58]:
# Remove the rows with missing names
df = df.dropna(subset=["EmpName"])
df

    EmpName         DOJ       Exp        Pkg Manager       Team
0     Ariba  01-02-2000  10 years  4000000.0  Sakpal  Marketing
1  Vishakha  03-05-2010   5 years  3000000.0   Sanap    Digital
2    Aniket  01-02-2006       NaN  4500000.0  Sakpal      Legal
4  Shailesh  01-01-2000  30 years  4000000.0  Sanika      Legal

In [59]:
# Replace the missing date in DOJ with the string ‘01-01-2000’
df['DOJ'] = df['DOJ'].replace('None', '01-01-2000')
df

    EmpName         DOJ       Exp        Pkg Manager       Team
0     Ariba  01-02-2000  10 years  4000000.0  Sakpal  Marketing
1  Vishakha  03-05-2010   5 years  3000000.0   Sanap    Digital
2    Aniket  01-02-2006       NaN  4500000.0  Sakpal      Legal
4  Shailesh  01-01-2000  30 years  4000000.0  Sanika      Legal

In [60]:
#  Replace the missing experience with the value ‘0 Years’
df['Exp'] = df['Exp'].replace(np.nan, '0 years')
df

    EmpName         DOJ       Exp        Pkg Manager       Team
0     Ariba  01-02-2000  10 years  4000000.0  Sakpal  Marketing
1  Vishakha  03-05-2010   5 years  3000000.0   Sanap    Digital
2    Aniket  01-02-2006   0 years  4500000.0  Sakpal      Legal
4  Shailesh  01-01-2000  30 years  4000000.0  Sanika      Legal

In [62]:
#  Replace the missing  package with the values 500000
df['Pkg'] = df['Pkg'].replace(np.nan, 500000)
df

    EmpName         DOJ       Exp        Pkg Manager       Team
0     Ariba  01-02-2000  10 years  4000000.0  Sakpal  Marketing
1  Vishakha  03-05-2010   5 years  3000000.0   Sanap    Digital
2    Aniket  01-02-2006   0 years  4500000.0  Sakpal      Legal
4  Shailesh  01-01-2000  30 years  4000000.0  Sanika      Legal